//задача 1 
//Задайте значение N. Напишите программу, которая выведет все натуральные
//числа в промежутке от 1 до N

/*
void Resurs(int n)
{
    if (n > 1) Resurs(n - 1);
    Console.Write(n + " ");   //если поменять местами, будет вывод от n До 1 
}

Resurs(10);
*/

//Задача 2 
// напишите программу которая будет принимать на воход 
//число и возвращать сумму его цифр